In [1]:
import mysql.connector

In [3]:
#connecting to the database
db = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'bree@2023.N'
)

In [4]:
#Check if the connection is successful
if db:
    print("Connection successful")

Connection successful

In [5]:
#creating a cursor to the db
c = db.cursor()

In [6]:
#Executing SQL statements using the cursor
c.execute("CREATE DATABASE pythonSQL")

In [7]:
#SQL statement to show databases
c.execute("SHOW DATABASES")

In [11]:
#Printing the databases
for  database in c:
    print(database)

('information_schema',)
('mysql',)
('performance_schema',)
('pythonsql',)
('sys',)

In [12]:
#using the database created earlier
c.execute("USE pythonSQL")

In [13]:
#creating a table - Persons
c.execute( "CREATE TABLE Persons (PersonID int,LastName varchar(255),FirstName varchar(255),Address varchar(255),City varchar(255))")

In [14]:
#Creating Employees table
c.execute("CREATE TABLE employees (id INT AUTO_INCREMENT PRIMARY KEY, EmployeeNo Varchar(255), FirstName Varchar(255), LastName Varchar(255), Age INT, Role Varchar(50))")

In [15]:
#Altering employees table by adding a column
c.execute("ALTER TABLE employees ADD Column Phone varChar(255)")

In [17]:
#Creating departments table 
c.execute("CREATE TABLE Departments (id INT AUTO_INCREMENT PRIMARY KEY, name varChar(255), Head INT, FOREIGN KEY (Head) REFERENCES employees(id))")

In [18]:

c.execute("ALTER TABLE employees ADD COLUMN DepartmentID INT")

In [19]:
#Adding foreign key to employees table
c.execute("ALTER TABLE employees ADD FOREIGN KEY (DepartmentID) REFERENCES departments(id)")

In [20]:
c.execute("SELECT * FROM employees")

In [21]:
for row in c:
    print(row)

In [25]:
#Inserting values into a table
c.execute("INSERT INTO Departments (name) VALUES ('Human Resources'), ('Engineering'), ('Marketing')")
#Committing changes to the db
db.commit()
#Print rows affected
print(c.rowcount," rows affected")

3  rows affected

In [26]:
c.execute("SELECT * FROM Departments")

In [27]:
for row in c:
    print(row)

(1, 'Human Resources', None)
(2, 'Engineering', None)
(3, 'Marketing', None)
(4, 'Human Resources', None)
(5, 'Engineering', None)
(6, 'Marketing', None)

In [28]:
#Insertion into employees table in bulk
sql = "INSERT INTO employees (EmployeeNo, FirstName, LastName, DepartmentID, Age ,Phone) VALUES (%s,%s,%s,%s,%s,%s)"
val = ('2005','Brigit','Chelangat',3,3,'6235472713676')
c.execute(sql,val)
db.commit()

In [30]:
print(c.rowcount,"rows affected")

1 rows affected

In [33]:
c.execute("SELECT * FROM employees")
for row in c:
    print(row)

(1, '2005', 'Brigit', 'Chelangat', 3, None, '6235472713676', 3)
(2, '2005', 'Oak', 'Tree', 4, None, '6235472713676', 3)
(3, '2005', 'Brian', 'Kiprono', 18, None, '6235472713676', 2)
(4, '2005', 'Evans', 'Ruto', 13, None, '6235472713676', 1)
(5, '2005', 'Kiptoo', 'Kemboi', 5, None, '6235472713676', 3)
(6, '2005', 'John', 'Doe', 6, None, '6235472713676', 3)
(7, '2005', 'Adam', 'Too', 16, None, '6235472713676', 2)
(8, '2005', 'Brigit', 'Eve', 23, None, '6235472713676', 2)
(9, '2005', 'Xanto', 'Chelangat', 30, None, '6235472713676', 2)

In [32]:
#Bulk insertion
sql = "INSERT INTO employees (EmployeeNo, FirstName, LastName, DepartmentID, Age ,Phone) VALUES (%s,%s,%s,%s,%s,%s)"
#Values are in a tuple
vals = [
    ('2005','Oak','Tree',3,4,'6235472713676'),
    ('2005','Brian','Kiprono',2,18,'6235472713676'),
    ('2005','Evans','Ruto',1,13,'6235472713676'),
    ('2005','Kiptoo','Kemboi',3,5,'6235472713676'),
    ('2005','John','Doe',3,6,'6235472713676'),
    ('2005','Adam','Too',2,16,'6235472713676'),
    ('2005','Brigit','Eve',2,23,'6235472713676'),
    ('2005','Xanto','Chelangat',2,30,'6235472713676')
    ]
#executemany function
c.executemany(sql,vals)
db.commit()
print(c.rowcount,"rows affected")

8 rows affected

In [34]:
q = "SELECT * FROM employees"
c.execute(q)

#Fetch Values
result = c.fetchall()
#Print the values
for row in result:
    print(row)

(1, '2005', 'Brigit', 'Chelangat', 3, None, '6235472713676', 3)
(2, '2005', 'Oak', 'Tree', 4, None, '6235472713676', 3)
(3, '2005', 'Brian', 'Kiprono', 18, None, '6235472713676', 2)
(4, '2005', 'Evans', 'Ruto', 13, None, '6235472713676', 1)
(5, '2005', 'Kiptoo', 'Kemboi', 5, None, '6235472713676', 3)
(6, '2005', 'John', 'Doe', 6, None, '6235472713676', 3)
(7, '2005', 'Adam', 'Too', 16, None, '6235472713676', 2)
(8, '2005', 'Brigit', 'Eve', 23, None, '6235472713676', 2)
(9, '2005', 'Xanto', 'Chelangat', 30, None, '6235472713676', 2)